; ModuleID = 'erfc.c'
source_filename = "erfc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gsl_sf_result_struct = type { double, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [30 x i8] c"gsl_sf_log_erfc_e(x, &result)\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"erfc.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%le\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"%.15e\0A\00", align 1
@.str.5 = private unnamed_addr constant [22 x i8] c"The Value of b is %f\0A\00", align 1
@erfc8_sum.P = internal global [6 x double] [double 0x4007D4B780645377, double 0x401DA3930A99D8DF, double 0x4018A40E0D3E694C, double 0x40141381C5862508, double 0x3FF467E6DAD8642A, double 0x3FE20DD750429B62], align 16, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "P", scope: !2, file: !3, line: 48, type: !54, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "erfc8_sum", scope: !3, file: !3, line: 43, type: !4, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !7, variables: !53)
!3 = !DIFile(filename: "erfc.c", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6}
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.1 (tags/RELEASE_601/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, globals: !47)
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 39, size: 32, elements: !11)
!10 = !DIFile(filename: "./../gsl/gsl_errno.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!12 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!13 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!14 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!15 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!16 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!17 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!18 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!19 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!20 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!21 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!22 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!23 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!24 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!25 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!26 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!27 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!28 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!29 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!30 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!31 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!32 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!33 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!34 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!35 = !DIEnumerator(name: "GSL_ESING", value: 21)
!36 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!37 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!38 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!39 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!40 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!41 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!42 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!43 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!44 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!45 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!46 = !DIEnumerator(name: "GSL_EOF", value: 32)
!47 = !{!0, !48}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "Q", scope: !2, file: !3, line: 56, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 448, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 7)
!53 = !{}
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 384, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 6)
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{!"clang version 6.0.1 (tags/RELEASE_601/final)"}
!61 = distinct !DISubprogram(name: "gsl_sf_log_erfc_e", scope: !3, file: !3, line: 308, type: !62, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, unit: !7, variables: !53)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !6, !65}
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !67, line: 41, baseType: !68)
!67 = !DIFile(filename: "/usr/local/include/gsl/gsl_sf_result.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !67, line: 37, size: 128, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !68, file: !67, line: 38, baseType: !6, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !68, file: !67, line: 39, baseType: !6, size: 64, offset: 64)
!72 = !DILocalVariable(name: "x", arg: 1, scope: !61, file: !3, line: 308, type: !6)
!73 = !DILocation(line: 308, column: 30, scope: !61)
!74 = !DILocalVariable(name: "result", arg: 2, scope: !61, file: !3, line: 308, type: !65)
!75 = !DILocation(line: 308, column: 49, scope: !61)
!76 = !DILocation(line: 312, column: 6, scope: !77)
!77 = distinct !DILexicalBlock(scope: !61, file: !3, line: 312, column: 6)
!78 = !DILocation(line: 312, column: 8, scope: !77)
!79 = !DILocation(line: 312, column: 7, scope: !77)
!80 = !DILocation(line: 312, column: 10, scope: !77)
!81 = !DILocation(line: 312, column: 6, scope: !61)
!82 = !DILocation(line: 313, column: 18, scope: !83)
!83 = distinct !DILexicalBlock(scope: !77, file: !3, line: 312, column: 40)
!84 = !DILocalVariable(name: "y", scope: !83, file: !3, line: 313, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!86 = !DILocation(line: 313, column: 22, scope: !83)
!87 = !DILocation(line: 313, column: 24, scope: !83)
!88 = !DILocalVariable(name: "c3", scope: !83, file: !3, line: 315, type: !85)
!89 = !DILocation(line: 315, column: 18, scope: !83)
!90 = !DILocalVariable(name: "c4", scope: !83, file: !3, line: 316, type: !85)
!91 = !DILocation(line: 316, column: 18, scope: !83)
!92 = !DILocalVariable(name: "c5", scope: !83, file: !3, line: 317, type: !85)
!93 = !DILocation(line: 317, column: 18, scope: !83)
!94 = !DILocalVariable(name: "c6", scope: !83, file: !3, line: 318, type: !85)
!95 = !DILocation(line: 318, column: 18, scope: !83)
!96 = !DILocalVariable(name: "c7", scope: !83, file: !3, line: 319, type: !85)
!97 = !DILocation(line: 319, column: 18, scope: !83)
!98 = !DILocalVariable(name: "c8", scope: !83, file: !3, line: 320, type: !85)
!99 = !DILocation(line: 320, column: 18, scope: !83)
!100 = !DILocalVariable(name: "c9", scope: !83, file: !3, line: 321, type: !85)
!101 = !DILocation(line: 321, column: 18, scope: !83)
!102 = !DILocalVariable(name: "c10", scope: !83, file: !3, line: 322, type: !85)
!103 = !DILocation(line: 322, column: 18, scope: !83)
!104 = !DILocalVariable(name: "c11", scope: !83, file: !3, line: 323, type: !85)
!105 = !DILocation(line: 323, column: 18, scope: !83)
!106 = !DILocalVariable(name: "c12", scope: !83, file: !3, line: 324, type: !85)
!107 = !DILocation(line: 324, column: 18, scope: !83)
!108 = !DILocalVariable(name: "c13", scope: !83, file: !3, line: 325, type: !85)
!109 = !DILocation(line: 325, column: 18, scope: !83)
!110 = !DILocalVariable(name: "c14", scope: !83, file: !3, line: 326, type: !85)
!111 = !DILocation(line: 326, column: 18, scope: !83)
!112 = !DILocalVariable(name: "series", scope: !83, file: !3, line: 327, type: !6)
!113 = !DILocation(line: 327, column: 12, scope: !83)
!114 = !DILocation(line: 327, column: 26, scope: !83)
!115 = !DILocation(line: 327, column: 34, scope: !83)
!116 = !DILocation(line: 327, column: 43, scope: !83)
!117 = !DILocation(line: 327, column: 52, scope: !83)
!118 = !DILocation(line: 327, column: 61, scope: !83)
!119 = !DILocation(line: 327, column: 74, scope: !83)
!120 = !DILocation(line: 327, column: 73, scope: !83)
!121 = !DILocation(line: 327, column: 68, scope: !83)
!122 = !DILocation(line: 327, column: 62, scope: !83)
!123 = !DILocation(line: 327, column: 59, scope: !83)
!124 = !DILocation(line: 327, column: 53, scope: !83)
!125 = !DILocation(line: 327, column: 50, scope: !83)
!126 = !DILocation(line: 327, column: 44, scope: !83)
!127 = !DILocation(line: 327, column: 41, scope: !83)
!128 = !DILocation(line: 327, column: 35, scope: !83)
!129 = !DILocation(line: 327, column: 32, scope: !83)
!130 = !DILocation(line: 327, column: 27, scope: !83)
!131 = !DILocation(line: 327, column: 24, scope: !83)
!132 = !DILocation(line: 328, column: 14, scope: !83)
!133 = !DILocation(line: 328, column: 23, scope: !83)
!134 = !DILocation(line: 328, column: 32, scope: !83)
!135 = !DILocation(line: 328, column: 40, scope: !83)
!136 = !DILocation(line: 328, column: 48, scope: !83)
!137 = !DILocation(line: 328, column: 56, scope: !83)
!138 = !DILocation(line: 328, column: 64, scope: !83)
!139 = !DILocation(line: 328, column: 72, scope: !83)
!140 = !DILocation(line: 328, column: 74, scope: !83)
!141 = !DILocation(line: 328, column: 73, scope: !83)
!142 = !DILocation(line: 328, column: 70, scope: !83)
!143 = !DILocation(line: 328, column: 65, scope: !83)
!144 = !DILocation(line: 328, column: 62, scope: !83)
!145 = !DILocation(line: 328, column: 57, scope: !83)
!146 = !DILocation(line: 328, column: 54, scope: !83)
!147 = !DILocation(line: 328, column: 49, scope: !83)
!148 = !DILocation(line: 328, column: 46, scope: !83)
!149 = !DILocation(line: 328, column: 41, scope: !83)
!150 = !DILocation(line: 328, column: 38, scope: !83)
!151 = !DILocation(line: 328, column: 33, scope: !83)
!152 = !DILocation(line: 328, column: 30, scope: !83)
!153 = !DILocation(line: 328, column: 24, scope: !83)
!154 = !DILocation(line: 328, column: 21, scope: !83)
!155 = !DILocation(line: 328, column: 15, scope: !83)
!156 = !DILocation(line: 328, column: 12, scope: !83)
!157 = !DILocation(line: 329, column: 26, scope: !83)
!158 = !DILocation(line: 329, column: 24, scope: !83)
!159 = !DILocation(line: 329, column: 5, scope: !83)
!160 = !DILocation(line: 329, column: 13, scope: !83)
!161 = !DILocation(line: 329, column: 17, scope: !83)
!162 = !DILocation(line: 330, column: 48, scope: !83)
!163 = !DILocation(line: 330, column: 56, scope: !83)
!164 = !DILocation(line: 330, column: 43, scope: !83)
!165 = !DILocation(line: 330, column: 41, scope: !83)
!166 = !DILocation(line: 330, column: 5, scope: !83)
!167 = !DILocation(line: 330, column: 13, scope: !83)
!168 = !DILocation(line: 330, column: 17, scope: !83)
!169 = !DILocation(line: 331, column: 5, scope: !83)
!170 = !DILocation(line: 343, column: 11, scope: !171)
!171 = distinct !DILexicalBlock(scope: !77, file: !3, line: 343, column: 11)
!172 = !DILocation(line: 343, column: 13, scope: !171)
!173 = !DILocation(line: 343, column: 11, scope: !77)
!174 = !DILocation(line: 344, column: 29, scope: !175)
!175 = distinct !DILexicalBlock(scope: !171, file: !3, line: 343, column: 20)
!176 = !DILocation(line: 344, column: 19, scope: !175)
!177 = !DILocation(line: 344, column: 5, scope: !175)
!178 = !DILocation(line: 344, column: 13, scope: !175)
!179 = !DILocation(line: 344, column: 17, scope: !175)
!180 = !DILocation(line: 345, column: 48, scope: !175)
!181 = !DILocation(line: 345, column: 56, scope: !175)
!182 = !DILocation(line: 345, column: 43, scope: !175)
!183 = !DILocation(line: 345, column: 41, scope: !175)
!184 = !DILocation(line: 345, column: 5, scope: !175)
!185 = !DILocation(line: 345, column: 13, scope: !175)
!186 = !DILocation(line: 345, column: 17, scope: !175)
!187 = !DILocation(line: 346, column: 5, scope: !175)
!188 = !DILocation(line: 349, column: 19, scope: !189)
!189 = distinct !DILexicalBlock(scope: !171, file: !3, line: 348, column: 8)
!190 = !DILocalVariable(name: "result_erfc", scope: !189, file: !3, line: 349, type: !66)
!191 = !DILocation(line: 350, column: 19, scope: !189)
!192 = !DILocation(line: 350, column: 5, scope: !189)
!193 = !DILocation(line: 351, column: 36, scope: !189)
!194 = !DILocation(line: 351, column: 20, scope: !189)
!195 = !DILocation(line: 351, column: 5, scope: !189)
!196 = !DILocation(line: 351, column: 13, scope: !189)
!197 = !DILocation(line: 351, column: 18, scope: !189)
!198 = !DILocation(line: 352, column: 37, scope: !189)
!199 = !DILocation(line: 352, column: 55, scope: !189)
!200 = !DILocation(line: 352, column: 41, scope: !189)
!201 = !DILocation(line: 352, column: 20, scope: !189)
!202 = !DILocation(line: 352, column: 5, scope: !189)
!203 = !DILocation(line: 352, column: 13, scope: !189)
!204 = !DILocation(line: 352, column: 18, scope: !189)
!205 = !DILocation(line: 353, column: 49, scope: !189)
!206 = !DILocation(line: 353, column: 57, scope: !189)
!207 = !DILocation(line: 353, column: 44, scope: !189)
!208 = !DILocation(line: 353, column: 42, scope: !189)
!209 = !DILocation(line: 353, column: 5, scope: !189)
!210 = !DILocation(line: 353, column: 13, scope: !189)
!211 = !DILocation(line: 353, column: 17, scope: !189)
!212 = !DILocation(line: 354, column: 5, scope: !189)
!213 = !DILocation(line: 356, column: 1, scope: !61)
!214 = distinct !DISubprogram(name: "log_erfc8", scope: !3, file: !3, line: 90, type: !4, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !7, variables: !53)
!215 = !DILocalVariable(name: "x", arg: 1, scope: !214, file: !3, line: 90, type: !6)
!216 = !DILocation(line: 90, column: 32, scope: !214)
!217 = !DILocalVariable(name: "e", scope: !214, file: !3, line: 92, type: !6)
!218 = !DILocation(line: 92, column: 10, scope: !214)
!219 = !DILocation(line: 93, column: 17, scope: !214)
!220 = !DILocation(line: 93, column: 7, scope: !214)
!221 = !DILocation(line: 93, column: 5, scope: !214)
!222 = !DILocation(line: 94, column: 11, scope: !214)
!223 = !DILocation(line: 94, column: 7, scope: !214)
!224 = !DILocation(line: 94, column: 16, scope: !214)
!225 = !DILocation(line: 94, column: 18, scope: !214)
!226 = !DILocation(line: 94, column: 17, scope: !214)
!227 = !DILocation(line: 94, column: 14, scope: !214)
!228 = !DILocation(line: 94, column: 5, scope: !214)
!229 = !DILocation(line: 95, column: 10, scope: !214)
!230 = !DILocation(line: 95, column: 3, scope: !214)
!231 = distinct !DISubprogram(name: "gsl_sf_log_erfc", scope: !3, file: !3, line: 383, type: !4, isLocal: false, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, unit: !7, variables: !53)
!232 = !DILocalVariable(name: "x", arg: 1, scope: !231, file: !3, line: 383, type: !6)
!233 = !DILocation(line: 383, column: 31, scope: !231)
!234 = !DILocalVariable(name: "result", scope: !231, file: !3, line: 385, type: !66)
!235 = !DILocation(line: 385, column: 3, scope: !231)
!236 = !DILocalVariable(name: "status", scope: !231, file: !3, line: 385, type: !64)
!237 = !DILocation(line: 385, column: 3, scope: !238)
!238 = distinct !DILexicalBlock(scope: !231, file: !3, line: 385, column: 3)
!239 = !DILocation(line: 385, column: 3, scope: !240)
!240 = distinct !DILexicalBlock(scope: !238, file: !3, line: 385, column: 3)
!241 = distinct !{!241, !239, !239}
!242 = !DILocation(line: 385, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !240, file: !3, line: 385, column: 3)
!244 = !DILocation(line: 386, column: 1, scope: !231)
!245 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 389, type: !246, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: false, unit: !7, variables: !53)
!246 = !DISubroutineType(types: !247)
!247 = !{!64, !64, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!251 = !DILocalVariable(name: "argc", arg: 1, scope: !245, file: !3, line: 389, type: !64)
!252 = !DILocation(line: 389, column: 14, scope: !245)
!253 = !DILocalVariable(name: "argv", arg: 2, scope: !245, file: !3, line: 389, type: !248)
!254 = !DILocation(line: 389, column: 27, scope: !245)
!255 = !DILocalVariable(name: "a", scope: !245, file: !3, line: 391, type: !6)
!256 = !DILocation(line: 391, column: 12, scope: !245)
!257 = !DILocalVariable(name: "b", scope: !245, file: !3, line: 391, type: !6)
!258 = !DILocation(line: 391, column: 15, scope: !245)
!259 = !DILocalVariable(name: "fp", scope: !245, file: !3, line: 392, type: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !262, line: 7, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !264, line: 49, size: 1728, elements: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !281, !283, !284, !285, !289, !291, !293, !297, !300, !302, !305, !308, !309, !311, !315, !316}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !264, line: 51, baseType: !64, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !264, line: 54, baseType: !249, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !264, line: 55, baseType: !249, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !264, line: 56, baseType: !249, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !264, line: 57, baseType: !249, size: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !264, line: 58, baseType: !249, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !264, line: 59, baseType: !249, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !264, line: 60, baseType: !249, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !264, line: 61, baseType: !249, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !264, line: 64, baseType: !249, size: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !264, line: 65, baseType: !249, size: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !264, line: 66, baseType: !249, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !264, line: 68, baseType: !279, size: 64, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !264, line: 36, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !264, line: 70, baseType: !282, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !264, line: 72, baseType: !64, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !264, line: 73, baseType: !64, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !264, line: 74, baseType: !286, size: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !287, line: 152, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!288 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !264, line: 77, baseType: !290, size: 16, offset: 1024)
!290 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !264, line: 78, baseType: !292, size: 8, offset: 1040)
!292 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !264, line: 79, baseType: !294, size: 8, offset: 1048)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 8, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 1)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !264, line: 81, baseType: !298, size: 64, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !264, line: 43, baseType: null)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !264, line: 89, baseType: !301, size: 64, offset: 1152)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !287, line: 153, baseType: !288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !264, line: 91, baseType: !303, size: 64, offset: 1216)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !264, line: 37, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !264, line: 92, baseType: !306, size: 64, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !264, line: 38, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !264, line: 93, baseType: !282, size: 64, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !264, line: 94, baseType: !310, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !264, line: 95, baseType: !312, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 62, baseType: !314)
!313 = !DIFile(filename: "/home/savcuda/Desktop/FloatFuz/clang+llvm/lib/clang/6.0.1/include/stddef.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc")
!314 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !264, line: 96, baseType: !64, size: 32, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !264, line: 98, baseType: !317, size: 160, offset: 1568)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 160, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 20)
!320 = !DILocation(line: 392, column: 11, scope: !245)
!321 = !DILocalVariable(name: "filename", scope: !245, file: !3, line: 393, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!324 = !DILocation(line: 393, column: 17, scope: !245)
!325 = !DILocation(line: 393, column: 28, scope: !245)
!326 = !DILocation(line: 394, column: 16, scope: !245)
!327 = !DILocation(line: 394, column: 10, scope: !245)
!328 = !DILocation(line: 394, column: 8, scope: !245)
!329 = !DILocation(line: 395, column: 12, scope: !245)
!330 = !DILocation(line: 395, column: 5, scope: !245)
!331 = !DILocation(line: 396, column: 12, scope: !245)
!332 = !DILocation(line: 396, column: 5, scope: !245)
!333 = !DILocation(line: 398, column: 24, scope: !245)
!334 = !DILocation(line: 398, column: 5, scope: !245)
!335 = !DILocation(line: 400, column: 25, scope: !245)
!336 = !DILocation(line: 400, column: 9, scope: !245)
!337 = !DILocation(line: 400, column: 7, scope: !245)
!338 = !DILocation(line: 403, column: 39, scope: !245)
!339 = !DILocation(line: 403, column: 5, scope: !245)
!340 = !DILocation(line: 405, column: 5, scope: !245)
!341 = !DILocalVariable(name: "x", arg: 1, scope: !2, file: !3, line: 43, type: !6)
!342 = !DILocation(line: 43, column: 32, scope: !2)
!343 = !DILocalVariable(name: "num", scope: !2, file: !3, line: 65, type: !6)
!344 = !DILocation(line: 65, column: 10, scope: !2)
!345 = !DILocalVariable(name: "den", scope: !2, file: !3, line: 65, type: !6)
!346 = !DILocation(line: 65, column: 19, scope: !2)
!347 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 66, type: !64)
!348 = !DILocation(line: 66, column: 7, scope: !2)
!349 = !DILocation(line: 68, column: 9, scope: !2)
!350 = !DILocation(line: 68, column: 7, scope: !2)
!351 = !DILocation(line: 69, column: 9, scope: !352)
!352 = distinct !DILexicalBlock(scope: !2, file: !3, line: 69, column: 3)
!353 = !DILocation(line: 69, column: 8, scope: !352)
!354 = !DILocation(line: 69, column: 13, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !3, line: 69, column: 3)
!356 = !DILocation(line: 69, column: 14, scope: !355)
!357 = !DILocation(line: 69, column: 3, scope: !352)
!358 = !DILocation(line: 70, column: 13, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !3, line: 69, column: 24)
!360 = !DILocation(line: 70, column: 15, scope: !359)
!361 = !DILocation(line: 70, column: 14, scope: !359)
!362 = !DILocation(line: 70, column: 23, scope: !359)
!363 = !DILocation(line: 70, column: 21, scope: !359)
!364 = !DILocation(line: 70, column: 19, scope: !359)
!365 = !DILocation(line: 70, column: 11, scope: !359)
!366 = !DILocation(line: 71, column: 3, scope: !359)
!367 = !DILocation(line: 69, column: 19, scope: !355)
!368 = !DILocation(line: 69, column: 3, scope: !355)
!369 = distinct !{!369, !357, !370}
!370 = !DILocation(line: 71, column: 3, scope: !352)
!371 = !DILocation(line: 72, column: 9, scope: !2)
!372 = !DILocation(line: 72, column: 7, scope: !2)
!373 = !DILocation(line: 73, column: 9, scope: !374)
!374 = distinct !DILexicalBlock(scope: !2, file: !3, line: 73, column: 3)
!375 = !DILocation(line: 73, column: 8, scope: !374)
!376 = !DILocation(line: 73, column: 13, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !3, line: 73, column: 3)
!378 = !DILocation(line: 73, column: 14, scope: !377)
!379 = !DILocation(line: 73, column: 3, scope: !374)
!380 = !DILocation(line: 74, column: 13, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !3, line: 73, column: 24)
!382 = !DILocation(line: 74, column: 15, scope: !381)
!383 = !DILocation(line: 74, column: 14, scope: !381)
