; ModuleID = 'sin.c'
source_filename = "sin.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cheb_series_struct = type { double*, i32, double, double, i32 }
%struct.gsl_sf_result_struct = type { double, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@sin_cs = internal global %struct.cheb_series_struct { double* getelementptr inbounds ([12 x double], [12 x double]* @sin_data, i32 0, i32 0), i32 11, double -1.000000e+00, double 1.000000e+00, i32 11 }, align 8, !dbg !0
@cos_cs = internal global %struct.cheb_series_struct { double* getelementptr inbounds ([11 x double], [11 x double]* @cos_data, i32 0, i32 0), i32 10, double -1.000000e+00, double 1.000000e+00, i32 10 }, align 8, !dbg !50
@.str = private unnamed_addr constant [25 x i8] c"gsl_sf_sin_e(x, &result)\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"sin.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%le\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"%.15e\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sin_cs", scope: !2, file: !3, line: 51, type: !52, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.1 (tags/RELEASE_601/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43)
!3 = !DIFile(filename: "sin.c", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 39, size: 32, elements: !7)
!6 = !DIFile(filename: "/usr/local/include/gsl/gsl_errno.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!8 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!9 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!10 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!11 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!12 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!13 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!14 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!15 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!16 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!17 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!18 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!19 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!20 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!21 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!22 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!23 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!24 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!25 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!26 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!27 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!28 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!29 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!30 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!31 = !DIEnumerator(name: "GSL_ESING", value: 21)
!32 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!33 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!34 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!35 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!36 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!37 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!38 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!39 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!40 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!41 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!42 = !DIEnumerator(name: "GSL_EOF", value: 32)
!43 = !{!0, !44, !50, !63}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "sin_data", scope: !2, file: !3, line: 37, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 768, elements: !48)
!47 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!48 = !{!49}
!49 = !DISubrange(count: 12)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "cos_cs", scope: !2, file: !3, line: 74, type: !52, isLocal: true, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "cheb_series", file: !53, line: 29, baseType: !54)
!53 = !DIFile(filename: "./../chebyshev.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cheb_series_struct", file: !53, line: 22, size: 320, elements: !55)
!55 = !{!56, !58, !60, !61, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !54, file: !53, line: 23, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !54, file: !53, line: 24, baseType: !59, size: 32, offset: 64)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !54, file: !53, line: 25, baseType: !47, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !54, file: !53, line: 26, baseType: !47, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "order_sp", scope: !54, file: !53, line: 27, baseType: !59, size: 32, offset: 256)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "cos_data", scope: !2, file: !3, line: 61, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 704, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 11)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 1, !"wchar_size", i32 4}
!71 = !{!"clang version 6.0.1 (tags/RELEASE_601/final)"}
!72 = distinct !DISubprogram(name: "gsl_sf_sin_e", scope: !3, file: !3, line: 89, type: !73, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !82)
!73 = !DISubroutineType(types: !74)
!74 = !{!59, !47, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !77, line: 41, baseType: !78)
!77 = !DIFile(filename: "/usr/local/include/gsl/gsl_sf_result.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !77, line: 37, size: 128, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !78, file: !77, line: 38, baseType: !47, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !78, file: !77, line: 39, baseType: !47, size: 64, offset: 64)
!82 = !{}
!83 = !DILocalVariable(name: "x", arg: 1, scope: !72, file: !3, line: 89, type: !47)
!84 = !DILocation(line: 89, column: 21, scope: !72)
!85 = !DILocalVariable(name: "result", arg: 2, scope: !72, file: !3, line: 89, type: !75)
!86 = !DILocation(line: 89, column: 40, scope: !72)
!87 = !DILocalVariable(name: "P1", scope: !88, file: !3, line: 94, type: !89)
!88 = distinct !DILexicalBlock(scope: !72, file: !3, line: 93, column: 3)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!90 = !DILocation(line: 94, column: 18, scope: !88)
!91 = !DILocalVariable(name: "P2", scope: !88, file: !3, line: 95, type: !89)
!92 = !DILocation(line: 95, column: 18, scope: !88)
!93 = !DILocalVariable(name: "P3", scope: !88, file: !3, line: 96, type: !89)
!94 = !DILocation(line: 96, column: 18, scope: !88)
!95 = !DILocalVariable(name: "sgn_x", scope: !88, file: !3, line: 98, type: !89)
!96 = !DILocation(line: 98, column: 18, scope: !88)
!97 = !DILocation(line: 98, column: 26, scope: !88)
!98 = !DILocalVariable(name: "abs_x", scope: !88, file: !3, line: 99, type: !89)
!99 = !DILocation(line: 99, column: 18, scope: !88)
!100 = !DILocation(line: 99, column: 31, scope: !88)
!101 = !DILocation(line: 99, column: 26, scope: !88)
!102 = !DILocation(line: 101, column: 8, scope: !103)
!103 = distinct !DILexicalBlock(scope: !88, file: !3, line: 101, column: 8)
!104 = !DILocation(line: 101, column: 14, scope: !103)
!105 = !DILocation(line: 101, column: 8, scope: !88)
!106 = !DILocation(line: 102, column: 20, scope: !107)
!107 = distinct !DILexicalBlock(scope: !103, file: !3, line: 101, column: 39)
!108 = !DILocalVariable(name: "x2", scope: !107, file: !3, line: 102, type: !89)
!109 = !DILocation(line: 102, column: 25, scope: !107)
!110 = !DILocation(line: 102, column: 27, scope: !107)
!111 = !DILocation(line: 102, column: 26, scope: !107)
!112 = !DILocation(line: 103, column: 21, scope: !107)
!113 = !DILocation(line: 103, column: 32, scope: !107)
!114 = !DILocation(line: 103, column: 34, scope: !107)
!115 = !DILocation(line: 103, column: 30, scope: !107)
!116 = !DILocation(line: 103, column: 23, scope: !107)
!117 = !DILocation(line: 103, column: 7, scope: !107)
!118 = !DILocation(line: 103, column: 15, scope: !107)
!119 = !DILocation(line: 103, column: 19, scope: !107)
!120 = !DILocation(line: 104, column: 26, scope: !107)
!121 = !DILocation(line: 104, column: 28, scope: !107)
!122 = !DILocation(line: 104, column: 27, scope: !107)
!123 = !DILocation(line: 104, column: 31, scope: !107)
!124 = !DILocation(line: 104, column: 30, scope: !107)
!125 = !DILocation(line: 104, column: 34, scope: !107)
!126 = !DILocation(line: 104, column: 21, scope: !107)
!127 = !DILocation(line: 104, column: 7, scope: !107)
!128 = !DILocation(line: 104, column: 15, scope: !107)
!129 = !DILocation(line: 104, column: 19, scope: !107)
!130 = !DILocation(line: 105, column: 7, scope: !107)
!131 = !DILocation(line: 108, column: 14, scope: !132)
!132 = distinct !DILexicalBlock(scope: !103, file: !3, line: 107, column: 10)
!133 = !DILocalVariable(name: "sgn_result", scope: !132, file: !3, line: 108, type: !47)
!134 = !DILocation(line: 108, column: 27, scope: !132)
!135 = !DILocalVariable(name: "y", scope: !132, file: !3, line: 109, type: !47)
!136 = !DILocation(line: 109, column: 14, scope: !132)
!137 = !DILocation(line: 109, column: 24, scope: !132)
!138 = !DILocation(line: 109, column: 29, scope: !132)
!139 = !DILocation(line: 109, column: 18, scope: !132)
!140 = !DILocalVariable(name: "octant", scope: !132, file: !3, line: 110, type: !59)
!141 = !DILocation(line: 110, column: 11, scope: !132)
!142 = !DILocation(line: 110, column: 20, scope: !132)
!143 = !DILocation(line: 110, column: 42, scope: !132)
!144 = !DILocation(line: 110, column: 36, scope: !132)
!145 = !DILocation(line: 110, column: 30, scope: !132)
!146 = !DILocation(line: 110, column: 24, scope: !132)
!147 = !DILocation(line: 110, column: 22, scope: !132)
!148 = !DILocalVariable(name: "stat_cs", scope: !132, file: !3, line: 111, type: !59)
!149 = !DILocation(line: 111, column: 11, scope: !132)
!150 = !DILocalVariable(name: "z", scope: !132, file: !3, line: 112, type: !47)
!151 = !DILocation(line: 112, column: 14, scope: !132)
!152 = !DILocation(line: 114, column: 10, scope: !153)
!153 = distinct !DILexicalBlock(scope: !132, file: !3, line: 114, column: 10)
!154 = !DILocation(line: 114, column: 10, scope: !132)
!155 = !DILocation(line: 115, column: 16, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !3, line: 114, column: 30)
!157 = !DILocation(line: 116, column: 16, scope: !156)
!158 = !DILocation(line: 117, column: 11, scope: !156)
!159 = !DILocation(line: 118, column: 7, scope: !156)
!160 = !DILocation(line: 120, column: 10, scope: !161)
!161 = distinct !DILexicalBlock(scope: !132, file: !3, line: 120, column: 10)
!162 = !DILocation(line: 120, column: 17, scope: !161)
!163 = !DILocation(line: 120, column: 10, scope: !132)
!164 = !DILocation(line: 121, column: 16, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !3, line: 120, column: 22)
!166 = !DILocation(line: 122, column: 23, scope: !165)
!167 = !DILocation(line: 122, column: 22, scope: !165)
!168 = !DILocation(line: 122, column: 20, scope: !165)
!169 = !DILocation(line: 123, column: 7, scope: !165)
!170 = !DILocation(line: 125, column: 13, scope: !132)
!171 = !DILocation(line: 125, column: 21, scope: !132)
!172 = !DILocation(line: 125, column: 23, scope: !132)
!173 = !DILocation(line: 125, column: 19, scope: !132)
!174 = !DILocation(line: 125, column: 31, scope: !132)
!175 = !DILocation(line: 125, column: 33, scope: !132)
!176 = !DILocation(line: 125, column: 29, scope: !132)
!177 = !DILocation(line: 125, column: 41, scope: !132)
!178 = !DILocation(line: 125, column: 43, scope: !132)
!179 = !DILocation(line: 125, column: 39, scope: !132)
!180 = !DILocation(line: 125, column: 9, scope: !132)
!181 = !DILocation(line: 127, column: 10, scope: !182)
!182 = distinct !DILexicalBlock(scope: !132, file: !3, line: 127, column: 10)
!183 = !DILocation(line: 127, column: 17, scope: !182)
!184 = !DILocation(line: 127, column: 10, scope: !132)
!185 = !DILocation(line: 128, column: 23, scope: !186)
!186 = distinct !DILexicalBlock(scope: !182, file: !3, line: 127, column: 23)
!187 = !DILocalVariable(name: "sin_cs_result", scope: !186, file: !3, line: 128, type: !76)
!188 = !DILocalVariable(name: "t", scope: !186, file: !3, line: 129, type: !89)
!189 = !DILocation(line: 129, column: 22, scope: !186)
!190 = !DILocation(line: 129, column: 35, scope: !186)
!191 = !DILocation(line: 129, column: 30, scope: !186)
!192 = !DILocation(line: 129, column: 29, scope: !186)
!193 = !DILocation(line: 129, column: 37, scope: !186)
!194 = !DILocation(line: 129, column: 43, scope: !186)
!195 = !DILocation(line: 130, column: 40, scope: !186)
!196 = !DILocation(line: 130, column: 19, scope: !186)
!197 = !DILocation(line: 130, column: 17, scope: !186)
!198 = !DILocation(line: 131, column: 23, scope: !186)
!199 = !DILocation(line: 131, column: 34, scope: !186)
!200 = !DILocation(line: 131, column: 36, scope: !186)
!201 = !DILocation(line: 131, column: 35, scope: !186)
!202 = !DILocation(line: 131, column: 54, scope: !186)
!203 = !DILocation(line: 131, column: 38, scope: !186)
!204 = !DILocation(line: 131, column: 32, scope: !186)
!205 = !DILocation(line: 131, column: 25, scope: !186)
!206 = !DILocation(line: 131, column: 9, scope: !186)
!207 = !DILocation(line: 131, column: 17, scope: !186)
!208 = !DILocation(line: 131, column: 21, scope: !186)
!209 = !DILocation(line: 132, column: 7, scope: !186)
!210 = !DILocation(line: 134, column: 23, scope: !211)
!211 = distinct !DILexicalBlock(scope: !182, file: !3, line: 133, column: 12)
!212 = !DILocalVariable(name: "cos_cs_result", scope: !211, file: !3, line: 134, type: !76)
!213 = !DILocalVariable(name: "t", scope: !211, file: !3, line: 135, type: !89)
!214 = !DILocation(line: 135, column: 22, scope: !211)
!215 = !DILocation(line: 135, column: 35, scope: !211)
!216 = !DILocation(line: 135, column: 30, scope: !211)
!217 = !DILocation(line: 135, column: 29, scope: !211)
!218 = !DILocation(line: 135, column: 37, scope: !211)
!219 = !DILocation(line: 135, column: 43, scope: !211)
!220 = !DILocation(line: 136, column: 40, scope: !211)
!221 = !DILocation(line: 136, column: 19, scope: !211)
!222 = !DILocation(line: 136, column: 17, scope: !211)
!223 = !DILocation(line: 137, column: 33, scope: !211)
!224 = !DILocation(line: 137, column: 32, scope: !211)
!225 = !DILocation(line: 137, column: 35, scope: !211)
!226 = !DILocation(line: 137, column: 34, scope: !211)
!227 = !DILocation(line: 137, column: 46, scope: !211)
!228 = !DILocation(line: 137, column: 48, scope: !211)
!229 = !DILocation(line: 137, column: 47, scope: !211)
!230 = !DILocation(line: 137, column: 66, scope: !211)
!231 = !DILocation(line: 137, column: 50, scope: !211)
!232 = !DILocation(line: 137, column: 44, scope: !211)
!233 = !DILocation(line: 137, column: 37, scope: !211)
!234 = !DILocation(line: 137, column: 27, scope: !211)
!235 = !DILocation(line: 137, column: 9, scope: !211)
!236 = !DILocation(line: 137, column: 17, scope: !211)
!237 = !DILocation(line: 137, column: 21, scope: !211)
!238 = !DILocation(line: 140, column: 22, scope: !132)
!239 = !DILocation(line: 140, column: 7, scope: !132)
!240 = !DILocation(line: 140, column: 15, scope: !132)
!241 = !DILocation(line: 140, column: 19, scope: !132)
!242 = !DILocation(line: 142, column: 10, scope: !243)
!243 = distinct !DILexicalBlock(scope: !132, file: !3, line: 142, column: 10)
!244 = !DILocation(line: 142, column: 16, scope: !243)
!245 = !DILocation(line: 142, column: 10, scope: !132)
!246 = !DILocation(line: 143, column: 28, scope: !247)
!247 = distinct !DILexicalBlock(scope: !243, file: !3, line: 142, column: 39)
!248 = !DILocation(line: 143, column: 36, scope: !247)
!249 = !DILocation(line: 143, column: 23, scope: !247)
!250 = !DILocation(line: 143, column: 9, scope: !247)
!251 = !DILocation(line: 143, column: 17, scope: !247)
!252 = !DILocation(line: 143, column: 21, scope: !247)
!253 = !DILocation(line: 144, column: 7, scope: !247)
!254 = !DILocation(line: 145, column: 15, scope: !255)
!255 = distinct !DILexicalBlock(scope: !243, file: !3, line: 145, column: 15)
!256 = !DILocation(line: 145, column: 21, scope: !255)
!257 = !DILocation(line: 145, column: 15, scope: !243)
!258 = !DILocation(line: 146, column: 29, scope: !259)
!259 = distinct !DILexicalBlock(scope: !255, file: !3, line: 145, column: 51)
!260 = !DILocation(line: 146, column: 27, scope: !259)
!261 = !DILocation(line: 146, column: 35, scope: !259)
!262 = !DILocation(line: 146, column: 60, scope: !259)
!263 = !DILocation(line: 146, column: 68, scope: !259)
!264 = !DILocation(line: 146, column: 55, scope: !259)
!265 = !DILocation(line: 146, column: 53, scope: !259)
!266 = !DILocation(line: 146, column: 9, scope: !259)
!267 = !DILocation(line: 146, column: 17, scope: !259)
!268 = !DILocation(line: 146, column: 21, scope: !259)
!269 = !DILocation(line: 147, column: 7, scope: !259)
!270 = !DILocation(line: 148, column: 15, scope: !271)
!271 = distinct !DILexicalBlock(scope: !255, file: !3, line: 148, column: 15)
!272 = !DILocation(line: 148, column: 21, scope: !271)
!273 = !DILocation(line: 148, column: 15, scope: !255)
!274 = !DILocation(line: 149, column: 57, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !3, line: 148, column: 49)
!276 = !DILocation(line: 149, column: 65, scope: !275)
!277 = !DILocation(line: 149, column: 52, scope: !275)
!278 = !DILocation(line: 149, column: 50, scope: !275)
!279 = !DILocation(line: 149, column: 9, scope: !275)
!280 = !DILocation(line: 149, column: 17, scope: !275)
!281 = !DILocation(line: 149, column: 21, scope: !275)
!282 = !DILocation(line: 150, column: 7, scope: !275)
!283 = !DILocation(line: 152, column: 52, scope: !284)
!284 = distinct !DILexicalBlock(scope: !271, file: !3, line: 151, column: 12)
!285 = !DILocation(line: 152, column: 60, scope: !284)
!286 = !DILocation(line: 152, column: 47, scope: !284)
!287 = !DILocation(line: 152, column: 45, scope: !284)
!288 = !DILocation(line: 152, column: 9, scope: !284)
!289 = !DILocation(line: 152, column: 17, scope: !284)
!290 = !DILocation(line: 152, column: 21, scope: !284)
!291 = !DILocation(line: 155, column: 14, scope: !132)
!292 = !DILocation(line: 155, column: 7, scope: !132)
!293 = !DILocation(line: 158, column: 1, scope: !72)
!294 = distinct !DISubprogram(name: "cheb_eval_e", scope: !295, file: !295, line: 3, type: !296, isLocal: true, isDefinition: true, scopeLine: 6, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !82)
!295 = !DIFile(filename: "./../cheb_eval.c", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!296 = !DISubroutineType(types: !297)
!297 = !{!59, !298, !89, !75}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!300 = !DILocalVariable(name: "cs", arg: 1, scope: !294, file: !295, line: 3, type: !298)
!301 = !DILocation(line: 3, column: 33, scope: !294)
!302 = !DILocalVariable(name: "x", arg: 2, scope: !294, file: !295, line: 4, type: !89)
!303 = !DILocation(line: 4, column: 26, scope: !294)
!304 = !DILocalVariable(name: "result", arg: 3, scope: !294, file: !295, line: 5, type: !75)
!305 = !DILocation(line: 5, column: 29, scope: !294)
!306 = !DILocalVariable(name: "j", scope: !294, file: !295, line: 7, type: !59)
!307 = !DILocation(line: 7, column: 7, scope: !294)
!308 = !DILocalVariable(name: "d", scope: !294, file: !295, line: 8, type: !47)
!309 = !DILocation(line: 8, column: 10, scope: !294)
!310 = !DILocalVariable(name: "dd", scope: !294, file: !295, line: 9, type: !47)
!311 = !DILocation(line: 9, column: 10, scope: !294)
!312 = !DILocalVariable(name: "y", scope: !294, file: !295, line: 11, type: !47)
!313 = !DILocation(line: 11, column: 10, scope: !294)
!314 = !DILocation(line: 11, column: 20, scope: !294)
!315 = !DILocation(line: 11, column: 19, scope: !294)
!316 = !DILocation(line: 11, column: 24, scope: !294)
!317 = !DILocation(line: 11, column: 28, scope: !294)
!318 = !DILocation(line: 11, column: 22, scope: !294)
!319 = !DILocation(line: 11, column: 32, scope: !294)
!320 = !DILocation(line: 11, column: 36, scope: !294)
!321 = !DILocation(line: 11, column: 30, scope: !294)
!322 = !DILocation(line: 11, column: 42, scope: !294)
!323 = !DILocation(line: 11, column: 46, scope: !294)
!324 = !DILocation(line: 11, column: 50, scope: !294)
!325 = !DILocation(line: 11, column: 54, scope: !294)
!326 = !DILocation(line: 11, column: 48, scope: !294)
!327 = !DILocation(line: 11, column: 39, scope: !294)
!328 = !DILocalVariable(name: "y2", scope: !294, file: !295, line: 12, type: !47)
!329 = !DILocation(line: 12, column: 10, scope: !294)
!330 = !DILocation(line: 12, column: 21, scope: !294)
!331 = !DILocation(line: 12, column: 19, scope: !294)
!332 = !DILocalVariable(name: "e", scope: !294, file: !295, line: 14, type: !47)
!333 = !DILocation(line: 14, column: 10, scope: !294)
!334 = !DILocation(line: 16, column: 11, scope: !335)
!335 = distinct !DILexicalBlock(scope: !294, file: !295, line: 16, column: 3)
!336 = !DILocation(line: 16, column: 15, scope: !335)
!337 = !DILocation(line: 16, column: 9, scope: !335)
!338 = !DILocation(line: 16, column: 7, scope: !335)
!339 = !DILocation(line: 16, column: 22, scope: !340)
!340 = distinct !DILexicalBlock(scope: !335, file: !295, line: 16, column: 3)
!341 = !DILocation(line: 16, column: 23, scope: !340)
!342 = !DILocation(line: 16, column: 3, scope: !335)
!343 = !DILocation(line: 17, column: 12, scope: !344)
!344 = distinct !DILexicalBlock(scope: !340, file: !295, line: 16, column: 33)
!345 = !DILocalVariable(name: "temp", scope: !344, file: !295, line: 17, type: !47)
!346 = !DILocation(line: 17, column: 19, scope: !344)
!347 = !DILocation(line: 18, column: 9, scope: !344)
!348 = !DILocation(line: 18, column: 12, scope: !344)
!349 = !DILocation(line: 18, column: 11, scope: !344)
!350 = !DILocation(line: 18, column: 16, scope: !344)
!351 = !DILocation(line: 18, column: 14, scope: !344)
!352 = !DILocation(line: 18, column: 21, scope: !344)
!353 = !DILocation(line: 18, column: 25, scope: !344)
!354 = !DILocation(line: 18, column: 27, scope: !344)
!355 = !DILocation(line: 18, column: 19, scope: !344)
!356 = !DILocation(line: 18, column: 7, scope: !344)
!357 = !DILocation(line: 19, column: 15, scope: !344)
!358 = !DILocation(line: 19, column: 18, scope: !344)
!359 = !DILocation(line: 19, column: 17, scope: !344)
!360 = !DILocation(line: 19, column: 10, scope: !344)
!361 = !DILocation(line: 19, column: 31, scope: !344)
!362 = !DILocation(line: 19, column: 26, scope: !344)
!363 = !DILocation(line: 19, column: 24, scope: !344)
!364 = !DILocation(line: 19, column: 42, scope: !344)
!365 = !DILocation(line: 19, column: 46, scope: !344)
!366 = !DILocation(line: 19, column: 48, scope: !344)
!367 = !DILocation(line: 19, column: 37, scope: !344)
!368 = !DILocation(line: 19, column: 35, scope: !344)
!369 = !DILocation(line: 19, column: 7, scope: !344)
!370 = !DILocation(line: 20, column: 10, scope: !344)
!371 = !DILocation(line: 20, column: 8, scope: !344)
!372 = !DILocation(line: 21, column: 3, scope: !344)
!373 = !DILocation(line: 16, column: 29, scope: !340)
!374 = !DILocation(line: 16, column: 3, scope: !340)
!375 = distinct !{!375, !342, !376}
!376 = !DILocation(line: 21, column: 3, scope: !335)
!377 = !DILocation(line: 24, column: 12, scope: !378)
!378 = distinct !DILexicalBlock(scope: !294, file: !295, line: 23, column: 3)
!379 = !DILocalVariable(name: "temp", scope: !378, file: !295, line: 24, type: !47)
!380 = !DILocation(line: 24, column: 19, scope: !378)
!381 = !DILocation(line: 25, column: 9, scope: !378)
!382 = !DILocation(line: 25, column: 11, scope: !378)
!383 = !DILocation(line: 25, column: 10, scope: !378)
!384 = !DILocation(line: 25, column: 15, scope: !378)
!385 = !DILocation(line: 25, column: 13, scope: !378)
!386 = !DILocation(line: 25, column: 26, scope: !378)
!387 = !DILocation(line: 25, column: 30, scope: !378)
!388 = !DILocation(line: 25, column: 24, scope: !378)
!389 = !DILocation(line: 25, column: 18, scope: !378)
!390 = !DILocation(line: 25, column: 7, scope: !378)
!391 = !DILocation(line: 26, column: 15, scope: !378)
!392 = !DILocation(line: 26, column: 17, scope: !378)
!393 = !DILocation(line: 26, column: 16, scope: !378)
!394 = !DILocation(line: 26, column: 10, scope: !378)
!395 = !DILocation(line: 26, column: 30, scope: !378)
!396 = !DILocation(line: 26, column: 25, scope: !378)
!397 = !DILocation(line: 26, column: 23, scope: !378)
!398 = !DILocation(line: 26, column: 47, scope: !378)
!399 = !DILocation(line: 26, column: 51, scope: !378)
!400 = !DILocation(line: 26, column: 42, scope: !378)
!401 = !DILocation(line: 26, column: 40, scope: !378)
!402 = !DILocation(line: 26, column: 34, scope: !378)
!403 = !DILocation(line: 26, column: 7, scope: !378)
!404 = !DILocation(line: 29, column: 17, scope: !294)
!405 = !DILocation(line: 29, column: 3, scope: !294)
!406 = !DILocation(line: 29, column: 11, scope: !294)
!407 = !DILocation(line: 29, column: 15, scope: !294)
!408 = !DILocation(line: 30, column: 35, scope: !294)
!409 = !DILocation(line: 30, column: 33, scope: !294)
!410 = !DILocation(line: 30, column: 44, scope: !294)
!411 = !DILocation(line: 30, column: 48, scope: !294)
!412 = !DILocation(line: 30, column: 50, scope: !294)
!413 = !DILocation(line: 30, column: 54, scope: !294)
!414 = !DILocation(line: 30, column: 39, scope: !294)
!415 = !DILocation(line: 30, column: 37, scope: !294)
!416 = !DILocation(line: 30, column: 3, scope: !294)
!417 = !DILocation(line: 30, column: 11, scope: !294)
!418 = !DILocation(line: 30, column: 15, scope: !294)
!419 = !DILocation(line: 32, column: 3, scope: !294)
!420 = distinct !DISubprogram(name: "gsl_sf_sin", scope: !3, file: !3, line: 166, type: !421, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !82)
!421 = !DISubroutineType(types: !422)
!422 = !{!47, !89}
!423 = !DILocalVariable(name: "x", arg: 1, scope: !420, file: !3, line: 166, type: !89)
!424 = !DILocation(line: 166, column: 32, scope: !420)
!425 = !DILocalVariable(name: "result", scope: !420, file: !3, line: 168, type: !76)
!426 = !DILocation(line: 168, column: 3, scope: !420)
!427 = !DILocalVariable(name: "status", scope: !420, file: !3, line: 168, type: !59)
!428 = !DILocation(line: 168, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !420, file: !3, line: 168, column: 3)
!430 = !DILocation(line: 168, column: 3, scope: !431)
!431 = distinct !DILexicalBlock(scope: !429, file: !3, line: 168, column: 3)
!432 = distinct !{!432, !430, !430}
!433 = !DILocation(line: 168, column: 3, scope: !434)
!434 = distinct !DILexicalBlock(scope: !431, file: !3, line: 168, column: 3)
!435 = !DILocation(line: 169, column: 1, scope: !420)
!436 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !437, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !2, variables: !82)
!437 = !DISubroutineType(types: !438)
!438 = !{!59, !59, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!442 = !DILocalVariable(name: "argc", arg: 1, scope: !436, file: !3, line: 173, type: !59)
!443 = !DILocation(line: 173, column: 14, scope: !436)
!444 = !DILocalVariable(name: "argv", arg: 2, scope: !436, file: !3, line: 173, type: !439)
!445 = !DILocation(line: 173, column: 27, scope: !436)
!446 = !DILocalVariable(name: "a", scope: !436, file: !3, line: 175, type: !47)
!447 = !DILocation(line: 175, column: 12, scope: !436)
!448 = !DILocalVariable(name: "b", scope: !436, file: !3, line: 175, type: !47)
!449 = !DILocation(line: 175, column: 15, scope: !436)
!450 = !DILocalVariable(name: "fp", scope: !436, file: !3, line: 176, type: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !453, line: 7, baseType: !454)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !455, line: 49, size: 1728, elements: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !472, !474, !475, !476, !480, !482, !484, !488, !491, !493, !496, !499, !500, !502, !506, !507}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !454, file: !455, line: 51, baseType: !59, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !454, file: !455, line: 54, baseType: !440, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !454, file: !455, line: 55, baseType: !440, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !454, file: !455, line: 56, baseType: !440, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !454, file: !455, line: 57, baseType: !440, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !454, file: !455, line: 58, baseType: !440, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !454, file: !455, line: 59, baseType: !440, size: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !454, file: !455, line: 60, baseType: !440, size: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !454, file: !455, line: 61, baseType: !440, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !454, file: !455, line: 64, baseType: !440, size: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !454, file: !455, line: 65, baseType: !440, size: 64, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !454, file: !455, line: 66, baseType: !440, size: 64, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !454, file: !455, line: 68, baseType: !470, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !455, line: 36, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !454, file: !455, line: 70, baseType: !473, size: 64, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !454, file: !455, line: 72, baseType: !59, size: 32, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !454, file: !455, line: 73, baseType: !59, size: 32, offset: 928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !454, file: !455, line: 74, baseType: !477, size: 64, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !478, line: 152, baseType: !479)
!478 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!479 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !454, file: !455, line: 77, baseType: !481, size: 16, offset: 1024)
!481 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !454, file: !455, line: 78, baseType: !483, size: 8, offset: 1040)
!483 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !454, file: !455, line: 79, baseType: !485, size: 8, offset: 1048)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 8, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 1)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !454, file: !455, line: 81, baseType: !489, size: 64, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !455, line: 43, baseType: null)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !454, file: !455, line: 89, baseType: !492, size: 64, offset: 1152)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !478, line: 153, baseType: !479)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !454, file: !455, line: 91, baseType: !494, size: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !455, line: 37, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !454, file: !455, line: 92, baseType: !497, size: 64, offset: 1280)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !455, line: 38, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !454, file: !455, line: 93, baseType: !473, size: 64, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !454, file: !455, line: 94, baseType: !501, size: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !454, file: !455, line: 95, baseType: !503, size: 64, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !504, line: 62, baseType: !505)
!504 = !DIFile(filename: "/home/savcuda/Desktop/FloatFuz/clang+llvm/lib/clang/6.0.1/include/stddef.h", directory: "/home/savcuda/Desktop/FloatFuz/benchmark/gsl-2.6/specfunc/gsl_sf_sin")
!505 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !454, file: !455, line: 96, baseType: !59, size: 32, offset: 1536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !454, file: !455, line: 98, baseType: !508, size: 160, offset: 1568)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 160, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 20)
!511 = !DILocation(line: 176, column: 11, scope: !436)
!512 = !DILocalVariable(name: "filename", scope: !436, file: !3, line: 177, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!515 = !DILocation(line: 177, column: 17, scope: !436)
!516 = !DILocation(line: 177, column: 28, scope: !436)
!517 = !DILocation(line: 178, column: 16, scope: !436)
!518 = !DILocation(line: 178, column: 10, scope: !436)
!519 = !DILocation(line: 178, column: 8, scope: !436)
!520 = !DILocation(line: 179, column: 12, scope: !436)
!521 = !DILocation(line: 179, column: 5, scope: !436)
!522 = !DILocation(line: 180, column: 12, scope: !436)
!523 = !DILocation(line: 180, column: 5, scope: !436)
!524 = !DILocation(line: 182, column: 24, scope: !436)
!525 = !DILocation(line: 182, column: 5, scope: !436)
!526 = !DILocation(line: 184, column: 20, scope: !436)
!527 = !DILocation(line: 184, column: 9, scope: !436)
!528 = !DILocation(line: 184, column: 7, scope: !436)
!529 = !DILocation(line: 187, column: 39, scope: !436)
!530 = !DILocation(line: 187, column: 5, scope: !436)
!531 = !DILocation(line: 189, column: 5, scope: !436)
