; ModuleID = 'test3.c'
source_filename = "test3.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%le\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"%.15e\0A\00", align 1
@.str.3 = private unnamed_addr constant [27 x i8] c"The Value of result is %f\0A\00", align 1
@__afl_area_ptr = external global i8*
@__afl_prev_loc = external thread_local global i32

; Function Attrs: noinline nounwind optnone uwtable
define i32 @main(i32, i8**) #0 !dbg !7 {
  %3 = load i32, i32* @__afl_prev_loc, !nosanitize !2
  %4 = load i8*, i8** @__afl_area_ptr, !nosanitize !2
  %5 = xor i32 %3, 48108
  %6 = getelementptr i8, i8* %4, i32 %5
  %7 = load i8, i8* %6, !nosanitize !2
  %8 = add i8 %7, 1
  store i8 %8, i8* %6, !nosanitize !2
  store i32 24054, i32* @__afl_prev_loc, !nosanitize !2
  %9 = alloca i32, align 4
  %10 = alloca i32, align 4
  %11 = alloca i8**, align 8
  %12 = alloca double, align 8
  %13 = alloca double, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 6.0.1 (tags/RELEASE_601/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "test3.c", directory: "/home/savcuda/Desktop/FloatFuz/tests/test3")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 6.0.1 (tags/RELEASE_601/final)"}
!7 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 7, type: !8, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10, !11}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !7, file: !1, line: 7, type: !10)
!15 = !DILocation(line: 7, column: 14, scope: !7)
!16 = !DILocalVariable(name: "argv", arg: 2, scope: !7, file: !1, line: 7, type: !11)
!17 = !DILocation(line: 7, column: 27, scope: !7)
!18 = !DILocalVariable(name: "a", scope: !7, file: !1, line: 9, type: !19)
!19 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!20 = !DILocation(line: 9, column: 12, scope: !7)
!21 = !DILocalVariable(name: "b", scope: !7, file: !1, line: 9, type: !19)
!22 = !DILocation(line: 9, column: 15, scope: !7)
!23 = !DILocalVariable(name: "result", scope: !7, file: !1, line: 9, type: !19)
!24 = !DILocation(line: 9, column: 18, scope: !7)
!25 = !DILocalVariable(name: "fp", scope: !7, file: !1, line: 10, type: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 7, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/savcuda/Desktop/FloatFuz/tests/test3")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !30, line: 49, size: 1728, elements: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "/home/savcuda/Desktop/FloatFuz/tests/test3")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !47, !49, !50, !51, !55, !57, !59, !63, !66, !68, !71, !74, !75, !77, !81, !82}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !29, file: !30, line: 51, baseType: !10, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !29, file: !30, line: 54, baseType: !12, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !29, file: !30, line: 55, baseType: !12, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !29, file: !30, line: 56, baseType: !12, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !29, file: !30, line: 57, baseType: !12, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !29, file: !30, line: 58, baseType: !12, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !29, file: !30, line: 59, baseType: !12, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !29, file: !30, line: 60, baseType: !12, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !29, file: !30, line: 61, baseType: !12, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !29, file: !30, line: 64, baseType: !12, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !29, file: !30, line: 65, baseType: !12, size: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !29, file: !30, line: 66, baseType: !12, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !29, file: !30, line: 68, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !30, line: 36, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !29, file: !30, line: 70, baseType: !48, size: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !29, file: !30, line: 72, baseType: !10, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !29, file: !30, line: 73, baseType: !10, size: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !29, file: !30, line: 74, baseType: !52, size: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 152, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/savcuda/Desktop/FloatFuz/tests/test3")
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !29, file: !30, line: 77, baseType: !56, size: 16, offset: 1024)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !29, file: !30, line: 78, baseType: !58, size: 8, offset: 1040)
!58 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !29, file: !30, line: 79, baseType: !60, size: 8, offset: 1048)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 1)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !29, file: !30, line: 81, baseType: !64, size: 64, offset: 1088)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !30, line: 43, baseType: null)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !29, file: !30, line: 89, baseType: !67, size: 64, offset: 1152)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !53, line: 153, baseType: !54)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !29, file: !30, line: 91, baseType: !69, size: 64, offset: 1216)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !30, line: 37, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !29, file: !30, line: 92, baseType: !72, size: 64, offset: 1280)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !30, line: 38, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !29, file: !30, line: 93, baseType: !48, size: 64, offset: 1344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !29, file: !30, line: 94, baseType: !76, size: 64, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !29, file: !30, line: 95, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 62, baseType: !80)
!79 = !DIFile(filename: "/home/savcuda/Desktop/FloatFuz/clang+llvm/lib/clang/6.0.1/include/stddef.h", directory: "/home/savcuda/Desktop/FloatFuz/tests/test3")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !29, file: !30, line: 96, baseType: !10, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !29, file: !30, line: 98, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DILocation(line: 10, column: 11, scope: !7)
!87 = !DILocalVariable(name: "filename", scope: !7, file: !1, line: 11, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!90 = !DILocation(line: 11, column: 17, scope: !7)
!91 = !DILocation(line: 11, column: 28, scope: !7)
!92 = !DILocation(line: 12, column: 16, scope: !7)
!93 = !DILocation(line: 12, column: 10, scope: !7)
!94 = !DILocation(line: 12, column: 8, scope: !7)
!95 = !DILocation(line: 13, column: 12, scope: !7)
!96 = !DILocation(line: 13, column: 5, scope: !7)
!97 = !DILocation(line: 14, column: 12, scope: !7)
!98 = !DILocation(line: 14, column: 5, scope: !7)
!99 = !DILocation(line: 18, column: 23, scope: !7)
!100 = !DILocation(line: 18, column: 5, scope: !7)
!101 = !DILocation(line: 20, column: 7, scope: !7)
!102 = !DILocation(line: 21, column: 9, scope: !103)
!103 = distinct !DILexicalBlock(scope: !7, file: !1, line: 21, column: 9)
!104 = !DILocation(line: 21, column: 13, scope: !103)
!105 = !DILocation(line: 21, column: 11, scope: !103)
!106 = !DILocation(line: 21, column: 9, scope: !7)
!107 = !DILocation(line: 23, column: 10, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !1, line: 23, column: 10)
!109 = distinct !DILexicalBlock(scope: !103, file: !1, line: 22, column: 5)
!110 = !DILocation(line: 23, column: 12, scope: !108)
!111 = !DILocation(line: 23, column: 10, scope: !109)
!112 = !DILocation(line: 25, column: 11, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !1, line: 25, column: 11)
!114 = distinct !DILexicalBlock(scope: !108, file: !1, line: 24, column: 6)
!115 = !DILocation(line: 25, column: 13, scope: !113)
!116 = !DILocation(line: 25, column: 11, scope: !114)
!117 = !DILocation(line: 27, column: 12, scope: !118)
!118 = distinct !DILexicalBlock(scope: !119, file: !1, line: 27, column: 12)
!119 = distinct !DILexicalBlock(scope: !113, file: !1, line: 26, column: 7)
!120 = !DILocation(line: 27, column: 14, scope: !118)
!121 = !DILocation(line: 27, column: 12, scope: !119)
!122 = !DILocation(line: 29, column: 25, scope: !123)
!123 = distinct !DILexicalBlock(scope: !124, file: !1, line: 29, column: 25)
!124 = distinct !DILexicalBlock(scope: !118, file: !1, line: 28, column: 17)
!125 = !DILocation(line: 29, column: 27, scope: !123)
!126 = !DILocation(line: 29, column: 25, scope: !124)
!127 = !DILocation(line: 31, column: 29, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !1, line: 31, column: 29)
!129 = distinct !DILexicalBlock(scope: !123, file: !1, line: 30, column: 21)
!130 = !DILocation(line: 31, column: 31, scope: !128)
!131 = !DILocation(line: 31, column: 29, scope: !129)
!132 = !DILocation(line: 33, column: 33, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !1, line: 33, column: 33)
!134 = distinct !DILexicalBlock(scope: !128, file: !1, line: 32, column: 25)
!135 = !DILocation(line: 33, column: 35, scope: !133)
!136 = !DILocation(line: 33, column: 33, scope: !134)
!137 = !DILocation(line: 35, column: 37, scope: !138)
!138 = distinct !DILexicalBlock(scope: !139, file: !1, line: 35, column: 37)
!139 = distinct !DILexicalBlock(scope: !133, file: !1, line: 34, column: 29)
!140 = !DILocation(line: 35, column: 39, scope: !138)
!141 = !DILocation(line: 35, column: 37, scope: !139)
!142 = !DILocation(line: 36, column: 29, scope: !138)
!143 = !DILocation(line: 36, column: 34, scope: !138)
!144 = !DILocation(line: 36, column: 38, scope: !138)
!145 = !DILocation(line: 36, column: 36, scope: !138)
!146 = !DILocation(line: 36, column: 31, scope: !138)
!147 = !DILocation(line: 36, column: 27, scope: !138)
!148 = !DILocation(line: 36, column: 25, scope: !138)
